src/Catalogs/ПодпискиНаРассылкиИОповещенияКлиентам/ПодпискиНаРассылкиИОповещенияКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодпискиНаРассылкиИОповещенияКлиентам</name>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ГруппаРассылокИОповещений</name>
    <type>
      <types>CatalogRef.ГруппыРассылокИОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПартнеру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИПартнераДляПисем</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИПартнераДляSMS</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьКонтактномуЛицуОбъектаОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИКонтактногоЛицаОбъектаОповещенияДляПисем</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКИКонтактногоЛицаОбъектаОповещенияДляSMS</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодпискаДействует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКонтактныхЛицАдресатов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКИДляПисем</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКИДляSMS</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПодпискиНаРассылкиИОповещенияКлиентам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ОтправлятьПартнеру Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИПартнераДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИПартнераДляSMS");

	КонецЕсли;
	
	Если Не ОтправлятьКонтактномуЛицуОбъектаОповещения Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИКонтактногоЛицаОбъектаОповещенияДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИКонтактногоЛицаОбъектаОповещенияДляSMS");
		
	КонецЕсли;
	
	РеквизитыГруппы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГруппаРассылокИОповещений,
	                                                              "ПредназначенаДляЭлектронныхПисем, ПредназначенаДляSMS");
	
	Если НЕ РеквизитыГруппы.ПредназначенаДляЭлектронныхПисем Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИКонтактногоЛицаОбъектаОповещенияДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИПартнераДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("КонтактныеЛица.ВидКИДляПисем");
		
	КонецЕсли;
	
	Если НЕ РеквизитыГруппы.ПредназначенаДляSMS Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИКонтактногоЛицаОбъектаОповещенияДляSMS");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКИПартнераДляSMS");
		МассивНепроверяемыхРеквизитов.Добавить("КонтактныеЛица.ВидКИДляSMS");
		
	КонецЕсли;
	
	Если ПодпискаДействует И (Не ОтправлятьПартнеру И НЕ ОтправлятьКонтактномуЛицуОбъектаОповещения И КонтактныеЛица.Количество() = 0) Тогда
		
		ТекстОшибки = НСтр("ru='Подписка действует, но не указан ни один адресат.';uk='Підписка діє, але не вказаний жодний адресат.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ОтправлятьПартнеру",
			,
			Отказ);
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	КоличествоКонтактныхЛицАдресатов = КонтактныеЛица.Количество();
	ШаблонНаименования = НСтр("ru='Для ""%1"" по ""%2""';uk='Для ""%1"" ""%2""'");
	ШаблонНаименования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования,
	                                                                       Строка(Владелец),
	                                                                       Строка(ГруппаРассылокИОповещений));
	
	Если СтрДлина(ШаблонНаименования) > 150 Тогда
		Наименование = Лев(ШаблонНаименования, 147) + "...";
	Иначе
		Наименование = ШаблонНаименования;
	КонецЕсли;
	
	КонтактныеЛица.Свернуть("КонтактноеЛицо, ВидКИДляПисем, ВидКИДляSMS");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
